# IFCCategory Template Set Active Template Method

Source: https://www.revitapidocs.com/2026/b32dd155-f74b-ff9f-e476-614477467061.htm

---

| IFCCategory Template Set Active Template Method |
| --- |

Overload List

|  | Name | Description |
| --- | --- | --- |
|  | SetActiveTemplate | Sets the mapping template element to be the active mapping template for its document. |
|  | SetActiveTemplate(Document) | **Obsolete.** Sets the mapping template element to be the active mapping template in the document. |

Top See Also

#### Reference

IFCCategoryTemplate Class Autodesk.Revit.DB Namespace